cases/fluids/flatplate_zpg_subsonic/solution/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Incompressible treatment. Re = U_inf * L / nu = 1 * 1 / 2e-7 = 5e6
// per unit length, matching TMR 2DZP conditions. Low Mach 0.2 is
// approximated as incompressible; Cf difference vs compressible is
// < 0.2% at this Mach, well inside T_good = 0.0001.

transportModel  Newtonian;

nu              2e-07;
