cases/fluids/flatplate_zpg_subsonic/solution/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         3000;

deltaT          1;

writeControl    timeStep;
writeInterval   500;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     true;             // writes the volVectorField to time dirs
        patches         (wall);
    }

    // Sample wallShearStress on the wall patch to a .raw file that has
    // per-face (x y z tau_x tau_y tau_z). Needed to extract C_f(x=0.97).
    wallSurfaceSample
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;
        interpolationScheme cellPoint;
        surfaceFormat   raw;
        fields          (wallShearStress);
        surfaces
        {
            wallSurface
            {
                type    patch;
                patches (wall);
                interpolate false;
            }
        }
    }

    forces1
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   50;

        patches         (wall);
        rho             rhoInf;
        rhoInf          1;
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         1;
        lRef            2;       // plate length
        Aref            2;       // plate length * unit-span width (z-thickness=1)

        // Bin drag along x so Cf(x) can be recovered: local Cf = bin_Cd * nBin
        binData
        {
            nBin        200;
            direction   (1 0 0);
            cumulative  false;
        }
    }
}
